In [1]:
import numpy as np
import pandas as pd

In [2]:
df = pd.DataFrame({'A':[1,2,np.nan],
                  'B':[5,np.nan,np.nan],
                  'C':[1,2,3]})  ## criando dataframe p emular os dados perdidos (geralmente vem como NAN)

In [3]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [4]:
df.dropna() #dropando todas linhas com valores nA

     A    B  C
0  1.0  5.0  1

In [5]:
df.dropna(axis=1) #setando parametro para mostrar somente coluna sem NAN

   C
0  1
1  2
2  3

In [6]:
df.dropna(thresh=2) #setando parametro p mostrar somente valores >2 NAN

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2

In [7]:
df.fillna(value='PREENCHER VALOR') #preenchendo valores NAN com string

                 A                B  C
0              1.0              5.0  1
1              2.0  PREENCHER VALOR  2
2  PREENCHER VALOR  PREENCHER VALOR  3

In [8]:
df['A'].fillna(value=df['A'].mean()) #preenchendo valor NAN coluna A com a media

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64